Repository: frankmanzhu/xiangqi-mobile
Catalog: Resources/Localizations/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# app.recovery.message
source: The saved game could not be validated. Its file has been preserved.
zh_hans: 无法验证已保存的对局，其文件已保留。
zh_hant: 無法驗證已儲存的對局，其檔案已保留。

# app.recovery.title
source: Saved game
zh_hans: 已保存的对局
zh_hant: 已儲存的對局

# board.label
source: Xiangqi board
zh_hans: 象棋棋盘
zh_hant: 象棋棋盤

# board.legalDestination
source: Legal destination
zh_hans: 合法落点
zh_hant: 合法落點

# board.practice
source: Practice board
zh_hans: 练习棋盘
zh_hant: 練習棋盤

# board.square.empty
source: Empty %@
zh_hans: 空位 %@
zh_hant: 空位 %@

# board.state.occupied
source: occupied
zh_hans: 已占
zh_hant: 已佔

# board.state.selectable
source: selectable
zh_hans: 可选
zh_hant: 可選

# board.study
source: Study board
zh_hans: 研习棋盘
zh_hant: 研習棋盤

# common.always
source: Always
zh_hans: 始终
zh_hant: 一律

# common.cancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# common.confirm
source: Confirm
zh_hans: 确认
zh_hant: 確認

# common.done
source: Done
zh_hans: 完成
zh_hant: 完成

# common.hint
source: Hint
zh_hans: 提示
zh_hant: 提示

# common.home
source: Home
zh_hans: 主页
zh_hant: 主頁

# common.moves
source: Moves
zh_hans: 着法
zh_hant: 著法

# common.next
source: Next
zh_hans: 下一步
zh_hant: 下一步

# common.off
source: Off
zh_hans: 关闭
zh_hant: 關閉

# common.ok
source: OK
zh_hans: 好
zh_hant: 好

# common.previous
source: Previous
zh_hans: 上一步
zh_hant: 上一步

# common.random
source: Random
zh_hans: 随机
zh_hant: 隨機

# common.restart
source: Restart
zh_hans: 重新开始
zh_hant: 重新開始

# common.result
source: Result
zh_hans: 结果
zh_hant: 結果

# common.resume
source: Resume
zh_hans: 继续
zh_hant: 繼續

# common.settings
source: Settings
zh_hans: 设置
zh_hant: 設定

# common.source
source: Source
zh_hans: 来源
zh_hant: 來源

# error.engine.invalidMove
source: The computer opponent returned a move that is not valid here.
zh_hans: 电脑对手返回的着法在此局面不合法。
zh_hant: 電腦對手回傳的著法在此局面不合法。

# error.engine.networkInvalid
source: The computer opponent's neural network failed its integrity check.
zh_hans: 电脑对手的神经网络未通过完整性校验。
zh_hant: 電腦對手的神經網路未通過完整性驗證。

# error.engine.networkMissing
source: The computer opponent's neural network is missing from this build.
zh_hans: 此版本缺少电脑对手的神经网络文件。
zh_hant: 此版本缺少電腦對手的神經網路檔案。

# error.engine.unavailable
source: The computer opponent could not finish its move.
zh_hans: 电脑对手未能完成走子。
zh_hant: 電腦對手未能完成走子。

# error.generic
source: Something went wrong.
zh_hans: 出了点问题。
zh_hant: 出了點問題。

# error.library.corruptRecord
source: This record could not be read.
zh_hans: 无法读取此棋谱。
zh_hant: 無法讀取此棋譜。

# error.library.unavailable
source: The learning library could not be opened.
zh_hans: 无法打开学习资料库。
zh_hant: 無法開啟學習資料庫。

# error.library.unsupportedSchema
source: This learning library was built for a different version of the app.
zh_hans: 此学习资料库与当前应用版本不匹配。
zh_hant: 此學習資料庫與目前應用程式版本不符。

# error.position.invalid
source: This position could not be read.
zh_hans: 无法读取此局面。
zh_hant: 無法讀取此局面。

# error.progress.unsupportedSchema
source: Your saved progress was written by a newer version of the app.
zh_hans: 你的学习进度由更新版本的应用保存。
zh_hant: 你的學習進度由更新版本的應用程式儲存。

# game.confirmMove
source: Confirm move
zh_hans: 确认着法
zh_hant: 確認著法

# game.flip
source: Flip
zh_hans: 翻转
zh_hant: 翻轉

# game.hint.available
source: Hint
zh_hans: 提示
zh_hant: 提示

# game.hint.destination
source: Hint shown
zh_hans: 已显示提示
zh_hant: 已顯示提示

# game.hint.searching
source: Finding
zh_hans: 搜索中
zh_hant: 搜尋中

# game.hint.source
source: Show square
zh_hans: 显示落点
zh_hant: 顯示落點

# game.leave
source: Leave game
zh_hans: 离开对局
zh_hant: 離開對局

source: Game menu
zh_hans: 对局菜单
zh_hant: 對局選單

# game.message.engineMismatch
source: Pikafish returned a move that does not match the current game.
zh_hans: Pikafish 返回的着法与当前对局不符。
zh_hant: Pikafish 回傳的著法與目前對局不符。

# game.message.notSaved
source: Game not saved
zh_hans: 对局未保存
zh_hant: 對局未儲存

# game.movesAction
source: Moves
zh_hans: 棋谱
zh_hant: 棋譜

# game.rail.engine
source: Pikafish · Level %lld
zh_hans: Pikafish · 第 %lld 级
zh_hant: Pikafish · 第 %lld 級

# game.rail.opponent
source: OPPONENT
zh_hans: 对手
zh_hant: 對手

# game.rail.player
source: PLAYER
zh_hans: 棋手
zh_hant: 棋手

# game.rail.toMove
source: TO MOVE
zh_hans: 轮走
zh_hant: 輪走

# game.rail.you
source: You · %@
zh_hans: 你 · %@
zh_hant: 你 · %@

# game.status.check
source: Check · %@ to move
zh_hans: 将军 · 轮到%@走
zh_hant: 將軍 · 輪到%@走

# game.status.computerToMove
source: Computer to move
zh_hans: 轮到电脑走
zh_hant: 輪到電腦走

# game.status.draw
source: Draw · %@
zh_hans: 和棋 · %@
zh_hant: 和棋 · %@

# game.status.reviewing
source: Reviewing move %1$lld of %2$lld
zh_hans: 正在回看第 %1$lld / %2$lld 着
zh_hant: 正在回看第 %1$lld / %2$lld 著

# game.status.sideToMove
source: %@ to move
zh_hans: 轮到%@走
zh_hant: 輪到%@走

# game.status.thinking
source: Pikafish is thinking…
zh_hans: Pikafish 正在思考…
zh_hant: Pikafish 正在思考…

# game.status.wins
source: %1$@ wins · %2$@
zh_hans: %1$@ 胜 · %2$@
zh_hant: %1$@ 勝 · %2$@

# game.status.yourMove
source: Your move
zh_hans: 轮到你走
zh_hant: 輪到你走

source: Game unavailable
zh_hans: 对局不可用
zh_hant: 對局無法使用

# game.undo
source: Undo
zh_hans: 悔棋
zh_hant: 悔棋

# gameMenu.formatNote
source: The saved record uses the starting FEN and ordered UCI moves. Display notation is derived, so games can be replayed and exchanged without depending on the visual theme.
zh_hans: 保存的棋谱使用起始 FEN 加有序 UCI 着法，显示用的记谱由此推导，因此对局可以重演和交换，不依赖于视觉主题。
zh_hant: 儲存的棋譜使用起始 FEN 加有序 UCI 著法，顯示用的記譜由此推導，因此對局可以重演與交換，不依賴於視覺主題。

# gameMenu.movesValue
source: UCI coordinates
zh_hans: UCI 坐标
zh_hant: UCI 座標

# gameMenu.newGame
source: New game
zh_hans: 新对局
zh_hant: 新對局

# gameMenu.resign
source: Resign
zh_hans: 认输
zh_hant: 認輸

# gameMenu.resignConfirm
source: Resign this game?
zh_hans: 确定认输吗？
zh_hant: 確定認輸嗎？

# gameMenu.rules
source: Rules
zh_hans: 规则
zh_hant: 規則

# gameMenu.saveAndLeave
source: Save and leave
zh_hans: 保存并离开
zh_hant: 儲存並離開

# gameMenu.section.format
source: Record format
zh_hans: 棋谱格式
zh_hant: 棋譜格式

# gameMenu.section.game
source: Game
zh_hans: 对局
zh_hant: 對局

# gameMenu.share
source: Share game record
zh_hans: 分享棋谱
zh_hant: 分享棋譜

# history.livePosition
source: Live position
zh_hans: 当前局面
zh_hant: 目前局面

# history.returnToLive
source: Return to live
zh_hans: 回到当前局面
zh_hant: 回到目前局面

# history.title
source: Moves · %lld
zh_hans: 棋谱 · %lld
zh_hant: 棋譜 · %lld

# home.continue.hint
source: Returns to the saved position
zh_hans: 回到已保存的局面
zh_hant: 回到已儲存的局面

# home.continue.subtitle
source: %1$@ · %2$lld moves
zh_hans: %1$@ · %2$lld 着
zh_hant: %1$@ · %2$lld 著

# home.continue.title
source: Continue game
zh_hans: 继续对局
zh_hant: 繼續對局

# home.hero.subtitle
source: Play, study, and sharpen your game—entirely offline.
zh_hans: 对弈、研习、精进棋艺——完全离线。
zh_hant: 對弈、研習、精進棋藝——完全離線。

# home.hero.title
source: The board is ready.
zh_hans: 棋盘已就绪。
zh_hant: 棋盤已就緒。

# home.mode.computer.subtitle
source: Challenge Pikafish offline
zh_hans: 离线挑战 Pikafish
zh_hant: 離線挑戰 Pikafish

# home.mode.learn.subtitle
source: Puzzles and master games
zh_hans: 残局题与大师对局
zh_hant: 殘局題與大師對局

# home.mode.learn.title
source: Learn and practice
zh_hans: 学习与练习
zh_hant: 學習與練習

# home.mode.twoPlayer.subtitle
source: Share this iPhone
zh_hans: 共用这台 iPhone
zh_hant: 共用這台 iPhone

# home.section.mode
source: CHOOSE A MODE
zh_hans: 选择模式
zh_hant: 選擇模式

# home.section.theme
source: BOARD THEME
zh_hans: 棋盘主题
zh_hant: 棋盤主題

# learn.category.endgames
source: Endgames
zh_hans: 残局
zh_hant: 殘局

# learn.category.fullGameTactics
source: Full-game tactics
zh_hans: 全盘战术
zh_hant: 全盤戰術

# learn.category.games
source: Games
zh_hans: 对局
zh_hant: 對局

# learn.category.matingPractice
source: Mating practice
zh_hans: 杀法练习
zh_hant: 殺法練習

# learn.category.middlegames
source: Middlegames
zh_hans: 中局
zh_hant: 中局

# learn.category.openings
source: Openings
zh_hans: 开局
zh_hant: 開局

# learn.couldNotLoadRecords
source: Could not load records
zh_hans: 无法载入棋谱
zh_hant: 無法載入棋譜

# learn.dataset.note
source: Dataset by Yu-Han Tseng and Bo-Nian Chen. Source records are decoded, converted to UCI, and legality-validated; ambiguous or invalid records are excluded.
zh_hans: 数据集由曾昱翰与陈柏年制作。原始棋谱经解码、转换为 UCI 并校验合法性；有歧义或无效的棋谱已被排除。
zh_hant: 資料集由曾昱翰與陳柏年製作。原始棋譜經解碼、轉換為 UCI 並驗證合法性；有歧義或無效的棋譜已被排除。

# learn.dataset.subtitle
source: Study master games, openings, middlegames, endgames, and tactical positions entirely offline.
zh_hans: 完全离线研习大师对局、开局、中局、残局和战术局面。
zh_hant: 完全離線研習大師對局、開局、中局、殘局與戰術局面。

# learn.dataset.title
source: Chinese Chess Practical Dataset
zh_hans: 中国象棋实用数据集
zh_hant: 中國象棋實用資料集

# learn.datasetRevision
source: Dataset revision
zh_hans: 数据集版本
zh_hant: 資料集版本

# learn.ecco
source: ECCO
zh_hans: ECCO 编码
zh_hant: ECCO 編碼

# learn.libraryUnavailable
source: Learning library unavailable
zh_hans: 学习资料库不可用
zh_hant: 學習資料庫無法使用

# learn.license
source: License
zh_hans: 许可证
zh_hant: 授權條款

# learn.loadingLibrary
source: Loading library…
zh_hans: 正在载入资料库…
zh_hant: 正在載入資料庫…

# learn.loadingRecords
source: Loading records…
zh_hans: 正在载入棋谱…
zh_hant: 正在載入棋譜…

# learn.plyCount
source: %lld plies
zh_hans: %lld 回合步
zh_hant: %lld 回合步

# learn.recordCount
source: %@ records
zh_hans: %@ 个棋谱
zh_hant: %@ 個棋譜

# learn.searchPrompt
source: Player, event, or ECCO
zh_hans: 棋手、赛事或 ECCO
zh_hant: 棋手、賽事或 ECCO

# learn.section.browse
source: Browse
zh_hans: 浏览
zh_hant: 瀏覽

# learn.title
source: Learn
zh_hans: 学习
zh_hant: 學習

# learn.validatedRecords
source: Validated records
zh_hans: 已验证棋谱
zh_hant: 已驗證棋譜

# licenses.bundledNotice
source: Bundled notice
zh_hans: 随附声明
zh_hant: 隨附聲明

# licenses.ccpd.authors
source: Yu-Han Tseng and Bo-Nian Chen (2026)
zh_hans: 曾昱翰、陈柏年（2026）
zh_hant: 曾昱翰、陳柏年（2026）

# licenses.ccpd.license
source: Creative Commons Attribution 4.0 International
zh_hans: 知识共享署名 4.0 国际
zh_hant: 創用 CC 姓名標示 4.0 國際

# licenses.ccpd.licenseLink
source: CC BY 4.0 license
zh_hans: CC BY 4.0 许可
zh_hant: CC BY 4.0 授權

# licenses.ccpd.name
source: Chinese Chess Practical Dataset (CCPD)
zh_hans: 中国象棋实用数据集（CCPD）
zh_hant: 中國象棋實用資料集（CCPD）

# licenses.ccpd.note
source: Xiangqi Mobile decodes the source text, converts Chinese notation to UCI, validates move legality, and indexes accepted records for offline study. Invalid or ambiguous records are excluded.
zh_hans: Xiangqi Mobile 解码源文本，将中文记谱转换为 UCI，校验着法合法性，并为离线研习建立索引。无效或有歧义的棋谱已被排除。
zh_hant: Xiangqi Mobile 解碼原始文字，將中文記譜轉換為 UCI，驗證著法合法性，並為離線研習建立索引。無效或有歧義的棋譜已被排除。

# licenses.ccpd.sourceLink
source: Dataset source
zh_hans: 数据集来源
zh_hant: 資料集來源

# licenses.engine.note
source: Pikafish is distributed under GNU GPL version 3. The bundled notice and authors list are included with the application.
zh_hans: Pikafish 以 GNU GPL v3 发布。随附的声明与作者名单已包含在应用中。
zh_hant: Pikafish 以 GNU GPL v3 發布。隨附的聲明與作者名單已包含在應用程式中。

# licenses.section.engine
source: Computer engine
zh_hans: 对弈引擎
zh_hant: 對弈引擎

# licenses.section.learning
source: Learning content
zh_hans: 学习内容
zh_hant: 學習內容

# licenses.title
source: Licenses
zh_hans: 许可
zh_hant: 授權

# mode.computer
source: Play Computer
zh_hans: 人机对弈
zh_hant: 人機對弈

# mode.localTwoPlayer
source: Two Players
zh_hans: 双人对弈
zh_hant: 雙人對弈

# newGame.level
source: Level
zh_hans: 级别
zh_hant: 等級

# newGame.levelDetail.1
source: A quick Pikafish search for a more forgiving game.
zh_hans: Pikafish 快速搜索，对局较为宽松。
zh_hant: Pikafish 快速搜尋，對局較為寬鬆。

# newGame.levelDetail.2
source: A responsive Pikafish opponent with credible tactics.
zh_hans: 反应迅速的 Pikafish 对手，战术可信。
zh_hant: 反應迅速的 Pikafish 對手，戰術可信。

# newGame.levelDetail.3
source: Consistent play for regular club players.
zh_hans: 稳定的棋力，适合常规棋社棋手。
zh_hant: 穩定的棋力，適合一般棋社棋手。

# newGame.levelDetail.4
source: A focused opponent that looks further ahead.
zh_hans: 算度更深的专注对手。
zh_hant: 算度更深的專注對手。

# newGame.levelDetail.5
source: The strongest built-in search setting.
zh_hans: 内置最强的搜索设置。
zh_hant: 內建最強的搜尋設定。

# newGame.levelName.1
source: Beginner
zh_hans: 入门
zh_hant: 入門

# newGame.levelName.2
source: Club learner
zh_hans: 棋社新手
zh_hant: 棋社新手

# newGame.levelName.3
source: Club player
zh_hans: 棋社棋手
zh_hant: 棋社棋手

# newGame.levelName.4
source: Expert
zh_hans: 高手
zh_hant: 高手

# newGame.levelName.5
source: Master
zh_hans: 大师
zh_hant: 大師

# newGame.mode
source: Mode
zh_hans: 模式
zh_hant: 模式

# newGame.redMovesFirst
source: Red moves first.
zh_hans: 红先走。
zh_hant: 紅先走。

# newGame.replace.confirm
source: Replace and start
zh_hans: 替换并开始
zh_hant: 取代並開始

# newGame.replace.message
source: The current unfinished game will be replaced by this new game.
zh_hans: 当前未完成的对局将被这局新棋替换。
zh_hant: 目前未完成的對局將被這局新棋取代。

# newGame.replace.title
source: Replace the saved game?
zh_hans: 要替换已保存的对局吗？
zh_hant: 要取代已儲存的對局嗎？

# newGame.section.side
source: Your side
zh_hans: 你执的一方
zh_hant: 你執的一方

# newGame.section.strength
source: Computer strength
zh_hans: 电脑棋力
zh_hant: 電腦棋力

# newGame.section.theme
source: Theme
zh_hans: 主题
zh_hant: 主題

# newGame.section.time
source: Time
zh_hans: 时间
zh_hant: 時間

# newGame.start
source: Start game
zh_hans: 开始对局
zh_hant: 開始對局

# newGame.title
source: New game
zh_hans: 新对局
zh_hant: 新對局

# piece.advisor
source: Advisor
zh_hans: 士仕
zh_hant: 士仕

# piece.cannon
source: Cannon
zh_hans: 炮
zh_hant: 砲

# piece.chariot
source: Chariot
zh_hans: 车
zh_hant: 車

# piece.elephant
source: Elephant
zh_hans: 象相
zh_hant: 象相

# piece.general
source: General
zh_hans: 将帅
zh_hant: 將帥

# piece.horse
source: Horse
zh_hans: 马
zh_hant: 馬

# piece.soldier
source: Soldier
zh_hans: 兵卒
zh_hant: 兵卒

# practice.chooseDestination
source: Choose a destination.
zh_hans: 请选择落点。
zh_hant: 請選擇落點。

# practice.completed
source: Line complete. Well done.
zh_hans: 棋路完成，做得好。
zh_hant: 棋路完成，做得好。

# practice.correct
source: Correct. The recorded reply has been played.
zh_hans: 正确。已自动走出棋谱中的应着。
zh_hant: 正確。已自動走出棋譜中的應著。

# practice.couldNotOpen
source: Could not open practice
zh_hans: 无法打开练习
zh_hant: 無法開啟練習

# practice.findBestMove
source: Find the best move.
zh_hans: 找出最佳着法。
zh_hant: 找出最佳著法。

# practice.hintFormat
source: Hint: %@
zh_hans: 提示：%@
zh_hant: 提示：%@

# practice.incorrect
source: Not the recorded move. Try again.
zh_hans: 这不是棋谱中的着法，请重试。
zh_hant: 這不是棋譜中的著法，請重試。

# practice.mistakes
source: Mistakes: %lld
zh_hans: 错误：%lld
zh_hant: 錯誤：%lld

# practice.moveProgress
source: Move %1$lld of %2$lld
zh_hans: 第 %1$lld / %2$lld 步
zh_hant: 第 %1$lld / %2$lld 步

# practice.opening
source: Opening practice…
zh_hans: 正在打开练习…
zh_hant: 正在開啟練習…

# practice.studyLine
source: Study line
zh_hans: 研习棋路
zh_hant: 研習棋路

# practice.title
source: Practice
zh_hans: 练习
zh_hant: 練習

# reason.checkmate
source: Checkmate
zh_hans: 将死
zh_hant: 將死

# reason.repetition
source: Repetition
zh_hans: 重复局面
zh_hant: 重複局面

# reason.resignation
source: Resignation
zh_hans: 认输
zh_hant: 認輸

# reason.stalemate
source: Stalemate
zh_hans: 困毙
zh_hant: 困斃

# reason.timeLoss
source: Time loss
zh_hans: 超时
zh_hant: 超時

# result.complete
source: Game complete
zh_hans: 对局结束
zh_hant: 對局結束

# result.draw
source: Draw
zh_hans: 和棋
zh_hant: 和棋

# result.review
source: Review moves
zh_hans: 回看棋谱
zh_hant: 回看棋譜

# result.summary.hints
source: Hints
zh_hans: 提示
zh_hant: 提示

# result.summary.moves
source: Moves
zh_hans: 着数
zh_hant: 著數

# result.summary.time
source: Time
zh_hans: 用时
zh_hant: 用時

# result.wins
source: %@ wins
zh_hans: %@ 胜
zh_hant: %@ 勝

# rules.advisor
source: Moves one point diagonally inside the palace.
zh_hans: 在九宫内斜走一格。
zh_hant: 在九宮內斜走一格。

# rules.cannon
source: Moves like a chariot, but captures by jumping exactly one intervening piece.
zh_hans: 走法同车，吃子时必须隔一个棋子跳过。
zh_hant: 走法同車，吃子時必須隔一個棋子跳過。

# rules.chariot
source: Moves any distance along a clear file or rank.
zh_hans: 沿无阻挡的直线或横线任意距离移动。
zh_hant: 沿無阻擋的直線或橫線任意距離移動。

# rules.elephant
source: Moves two points diagonally, cannot jump, and cannot cross the river.
zh_hans: 斜走两格，不可越子，不可过河。
zh_hant: 斜走兩格，不可越子，不可過河。

# rules.general
source: Moves one point orthogonally inside the palace. The generals may not face on an open file.
zh_hans: 在九宫内直走一格。两将不可在同一直线上照面。
zh_hant: 在九宮內直走一格。兩將不可在同一直線上照面。

# rules.goal
source: Checkmate the opposing general. Red moves first. A side with no legal move loses.
zh_hans: 将死对方的将帅。红先走。无合法着法的一方判负。
zh_hant: 將死對方的將帥。紅先走。無合法著法的一方判負。

# rules.horse
source: Moves one orthogonal step then one diagonal step; the first step cannot be blocked.
zh_hans: 先直行一格再斜行一格；第一格不可被蹩马腿。
zh_hant: 先直行一格再斜行一格；第一格不可被蹩馬腿。

# rules.notation
source: Files are a–i and ranks are 0–9. A move such as b2e2 records its source and destination. The game stores the starting FEN plus this ordered move list for reliable replay and sharing.
zh_hans: 纵线为 a–i，横线为 0–9。像 b2e2 这样的着法记录起点与终点。对局保存起始 FEN 加上这份有序着法表，以便可靠地重演与分享。
zh_hant: 縱線為 a–i，橫線為 0–9。像 b2e2 這樣的著法記錄起點與終點。對局儲存起始 FEN 加上這份有序著法表，以便可靠地重演與分享。

# rules.section.goal
source: Goal
zh_hans: 目标
zh_hant: 目標

# rules.section.notation
source: Notation
zh_hans: 记谱
zh_hant: 記譜

# rules.section.pieces
source: Pieces
zh_hans: 棋子
zh_hant: 棋子

# rules.soldier
source: Moves forward one point. After crossing the river it may also move sideways, never backward.
zh_hans: 向前走一格。过河后可以横走，但始终不能后退。
zh_hant: 向前走一格。過河後可以橫走，但始終不能後退。

# rules.title
source: Rules
zh_hans: 规则
zh_hant: 規則

# settings.appLanguage
source: App language
zh_hans: 应用语言
zh_hant: 應用程式語言

# settings.computer
source: Computer
zh_hans: 电脑对手
zh_hant: 電腦對手

# settings.confirmMoves
source: Confirm moves
zh_hans: 落子需确认
zh_hant: 落子需確認

# settings.coordinates
source: Coordinates
zh_hans: 坐标
zh_hant: 座標

# settings.coordinatesOption.redPerspective
source: Red perspective
zh_hans: 红方视角
zh_hant: 紅方視角

# settings.engineNote
source: Computer play uses the bundled Pikafish engine and NNUE network entirely on-device. No account or network access is required.
zh_hans: 人机对弈完全在本机运行，使用内置的 Pikafish 引擎与 NNUE 网络，无需账号或网络连接。
zh_hant: 人機對弈完全在本機執行，使用內建的 Pikafish 引擎與 NNUE 網路，無需帳號或網路連線。

# settings.haptics
source: Haptics
zh_hans: 触感反馈
zh_hant: 觸感回饋

# settings.howToPlay
source: How to play
zh_hans: 怎样下棋
zh_hant: 怎樣下棋

# settings.language.simplifiedChinese
source: Simplified Chinese
zh_hans: 简体中文
zh_hant: 簡體中文

# settings.language.system
source: System Default
zh_hans: 跟随系统
zh_hant: 跟隨系統

# settings.language.traditionalChinese
source: Traditional Chinese
zh_hans: 繁体中文
zh_hant: 繁體中文

# settings.licenses
source: Open-source and content licenses
zh_hans: 开源与内容许可
zh_hant: 開源與內容授權

# settings.moveRecord
source: Move record
zh_hans: 棋谱格式
zh_hant: 棋譜格式

# settings.pieceLabels
source: Piece labels
zh_hans: 棋子字体
zh_hant: 棋子字體

# settings.pieceLabelsOption.simplified
source: Simplified Chinese
zh_hans: 简体中文
zh_hant: 簡體中文

# settings.pieceLabelsOption.traditional
source: Traditional Chinese
zh_hans: 繁体中文
zh_hant: 繁體中文

# settings.rulesPolicy
source: Rules policy
zh_hans: 规则版本
zh_hant: 規則版本

# settings.section.about
source: About
zh_hans: 关于
zh_hant: 關於

# settings.section.appearance
source: Appearance
zh_hans: 外观
zh_hant: 外觀

# settings.section.interaction
source: Interaction
zh_hans: 操作
zh_hant: 操作

# settings.section.language
source: Language
zh_hans: 语言
zh_hant: 語言

# settings.section.rules
source: Rules and records
zh_hans: 规则与棋谱
zh_hant: 規則與棋譜

# settings.sounds
source: Sound effects
zh_hans: 音效
zh_hant: 音效

# settings.soundsPreviewHint
source: Turning this on plays a sample.
zh_hans: 打开时会播放示例音效。
zh_hant: 開啟時會播放範例音效。

# settings.theme
source: Theme
zh_hans: 主题
zh_hant: 主題

# settings.title
source: Settings
zh_hans: 设置
zh_hant: 設定

# settings.version
source: Version
zh_hans: 版本
zh_hant: 版本

# side.black
source: Black
zh_hans: 黑方
zh_hant: 黑方

# side.red
source: Red
zh_hans: 红方
zh_hant: 紅方

# study.attribution
source: CCPD · CC BY 4.0 · Modified by decoding, notation normalization, and legality validation.
zh_hans: CCPD · CC BY 4.0 · 经解码、记谱规范化与合法性校验修改。
zh_hant: CCPD · CC BY 4.0 · 經解碼、記譜規範化與合法性驗證修改。

# study.bookmark
source: Bookmark
zh_hans: 收藏
zh_hant: 收藏

# study.couldNotOpen
source: Could not open record
zh_hans: 无法打开棋谱
zh_hant: 無法開啟棋譜

# study.opening
source: Opening record…
zh_hans: 正在打开棋谱…
zh_hant: 正在開啟棋譜…

# study.practice
source: Practice
zh_hans: 练习
zh_hant: 練習

# study.recordMissing
source: The record is not present in this library.
zh_hans: 该棋谱不在此资料库中。
zh_hant: 該棋譜不在此資料庫中。

# study.removeBookmark
source: Remove bookmark
zh_hans: 取消收藏
zh_hant: 取消收藏

# study.title
source: Study
zh_hans: 研习
zh_hant: 研習

# theme.accessibilityLabel
source: %@ theme
zh_hans: %@ 主题
zh_hant: %@ 主題

# theme.calm
source: Calm
zh_hans: 静雅
zh_hant: 靜雅

# theme.classic
source: Classic
zh_hans: 经典
zh_hant: 經典

# theme.tournament
source: Tournament
zh_hans: 赛场
zh_hant: 賽場

# timeControl.casual
source: Casual
zh_hans: 不限时
zh_hant: 不限時

# timeControl.fifteenMinutes
source: 15 min
zh_hans: 15 分钟
zh_hant: 15 分鐘

# timeControl.tenMinutes
source: 10 min
zh_hans: 10 分钟
zh_hant: 10 分鐘
